org/jekyll/_drafts/2024-10-03-ai-career.html
---
layout: post.liquid
title:  "AI Career"
date: 2024-10-02
last_updated: 2024-10-02
tags:
  - journal
  - ai
  - career
  - chollet
  - software
categories: [journal]
permalink: /2024-10-02-ai-career
toc: false
---


<p>
After 14 years as a software engineer I decided to
switch roles to work on IT infrastructure and discarded the the idea
to pursue roles for AI projects. 
</p>

{% include amzn_affiliate_disclaimer.html %}


<div id="outline-container-org4af124b" class="outline-2">
<h2 id="org4af124b"><span class="section-number-2">1.</span> Act I</h2>
<div class="outline-text-2" id="text-1">
<p>
Working as a software engineer can be stressful. The pace of
modern/agile software teams is fast, bi-weekly sprints, continuous
delivery, you build it &#x2026; you run it, etc.. On top of that, having
to learn the next programming tool/technique is very demanding.
</p>

<p>
I'm more of a thinker than a tinkerer; I like to look at topic from
different angles, do some research, try a few experiments, step back
and switch to something else while I let my brain process what I've
learned, I might or might not come back to the topic depending on my
level of interest or curiosity. My working preferences were not
compatible with my programming job.
</p>

<p>
During my vacation around the end of 2021 I was going over my life
choices and career prospects; I thought that I was ready to commit
to a role long-term but I needed to do some research to understand
my options and compare them somehow.  
</p>
</div>
</div>



<div id="outline-container-org9f9a106" class="outline-2">
<h2 id="org9f9a106"><span class="section-number-2">2.</span> Act II</h2>
<div class="outline-text-2" id="text-2">
<p>
The first half of my career has been writing network clients and
then writing application servers and release automation for the
other half. I felt that I had been doing the same over and over only
with different technologies and industry domains.
</p>

<p>
I didn't feel that I could make a drastic change like going out of
the software scene since writing software was my main activity in
the past 10 years. I am not a big risk taker so I only considered
alternative paths that could benefit from my experience as a
programmer. 
</p>

<p>
I had narrowed down my options to two: software architecture and
artificial intelligence.
</p>

<p>
In recent projects, my interest was often to get a glimpse of
the the high-level architecture and I would approach it by studying
the delivery pipelines; when available, they describe the process
each code change goes through to make it to a production
environment.
</p>

<p>
Artificial Intelligence was interesting because it aligns well with
personal interest in the automation of knowledge organization and
discovery.
</p>

<p>
I found two resources that helped me Learn about what AI projects
might look like in the industry:
</p>

<ol class="org-ol">
<li>Chollet's book:
<a href="https://amzn.to/3BsKjwK" target="_blank">
     Deep Learning with Python:</a>
the Universal Machine Learning workflow was exactly what I was
looking for at the time, a high-level overview of the life cycle
of an ML Project.</li>

<li>Andrew Ng's content at <a href="https://www.deeplearning.ai/">deeplearning.ai</a>: there I found
descriptions of the different roles required to execute AI
projects in the enterprise world. The site also has tools to
asses your readiness for specific roles.</li>
</ol>


<p>
I was dissapointed but not very suprised to learn that machine
learning projects look very similar to other software projects.
</p>

<p>
AI/ML engineers bring their specialized skills to a project and were
I to join an AI project, I would end up in a role almost
indistinguishable to my current role, namely working on the delivery
of AI-powered software to production environments.
</p>
</div>
</div>


<div id="outline-container-org71c366e" class="outline-2">
<h2 id="org71c366e"><span class="section-number-2">3.</span> Act III</h2>
<div class="outline-text-2" id="text-3">
<p>
During my vacation I made the resolution to double down and continue
working as a software engineer and become even more proficient
writing code for applications and release automation.
</p>

<p>
My resolution lasted about 4 hours after my return to work. On my
first day after vacation, all it took was to read my mailbox and
chat messages to remind me the many reasons why I was considering a
change in the first place.
</p>

<p>
I started looking for a new role and that lead me into the world of
IT infrastructure architecture. The company is large and for the
past 50 years has deployed pretty much every piece of technology
worth mentioning; my IT universe expanded and I felt quite good
about not pursing AI/ML.
</p>

<p>
If you are considering a career in AI/ML, I highly recommend
Chollet's book; it's a window into the world of machine learning
engineering in the industry, directly from a very influential
software engineer and AI researcher.
</p>
</div>
</div>
